# GetPhaseStatusPresentation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseFilter..::..GetPhaseStatusPresentation Method
PhaseFilter Class See Also
---
Gets the phase status presentation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PhaseStatusPresentation GetPhaseStatusPresentation(
	ElementOnPhaseStatus status
)
```

Visual Basic
---
```text
Public Function GetPhaseStatusPresentation ( _
	status As ElementOnPhaseStatus _
) As PhaseStatusPresentation
```

Visual C++
---
```text
public:
PhaseStatusPresentation GetPhaseStatusPresentation(
	ElementOnPhaseStatus status
)
```

# ### Parameters
status
    Type: Autodesk.Revit.DB..::..ElementOnPhaseStatus The element phase status.
# ### Return Value
The phase status presentation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | status is invalid for presentation query. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace